#include <iostream>
using namespace std;

/*

*/

int main() {

     return 0;
}

/*
Cпецификаторы формата можно использовать в функциях вывода, таких как printf(), cout и других. 
Вот основные:
%d - для вывода целых десятичных чисел
%i - для вывода целых десятичных чисел (аналогично %d)
%o - для вывода целых чисел в восьмеричной системе счисления
%x - для вывода целых чисел в шестнадцатеричной системе счисления (в нижнем регистре)
%X - для вывода целых чисел в шестнадцатеричной системе счисления (в верхнем регистре)
%u - для вывода целых беззнаковых чисел
%f - для вывода чисел с плавающей точкой в десятичном формате
%e - для вывода чисел с плавающей точкой в экспоненциальном формате
%g - для вывода чисел с плавающей точкой в наиболее компактном формате (либо %f, либо %e)
%c - для вывода одного символа
%s - для вывода строки
%p - для вывода указателя в шестнадцатеричном формате
*/


